<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"e62473ddb8a56db6a47dc8843ce06ca17bdc3f3e7ca53d67af7920105794d2f5","plan_job_ref":"Job Build and Deploy #8 at https://github.com/swibrow/actions-playground/actions/runs/8534982644","plan_out_hash":"5bd8e77a7ed4c1e14b1701a8a2058a3230df27f9fb2deb1380e46129c207a871","plan_hash":"39eb9c3d4ebc3eddb7b5facab5883e0678235757046f611b7fe22634cd7d864b","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "image_tag" but a value was
found in file "/tmp/variables.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Build and Deploy #8](https://github.com/swibrow/actions-playground/actions/runs/8534982644)